tests/performance/results/TASK-007/05-stress-warm-warmup.txt


  █ TOTAL RESULTS 

    checks_total.......: 400     122.675173/s
    checks_succeeded...: 100.00% 400 out of 400
    checks_failed......: 0.00%   0 out of 400

    ✓ detail: correct id
    ✓ detail: seeded version

    CUSTOM
    unexpected_errors..............: 0.00%  0 out of 200

    HTTP
    http_req_duration..............: med=11.06ms p(95)=15.72ms
      { expected_response:true }...: med=11.06ms p(95)=15.72ms
    http_req_failed................: 0.00%  0 out of 201
    http_reqs......................: 201    61.644274/s

    EXECUTION
    iteration_duration.............: med=11.24ms p(95)=15.71ms
    iterations.....................: 200    61.337586/s
    vus............................: 1      min=1        max=1
    vus_max........................: 1      min=1        max=1

    NETWORK
    data_received..................: 167 kB 51 kB/s
    data_sent......................: 37 kB  12 kB/s